Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: الذين كذبوا بالكتاب وبما أرسلنا به رسلنا فسوف يعلمون
en: Those who deny the Scripture and that wherewith We send Our messengers. But they will come to know,

source: إذ الأغلال في أعناقهم والسلاسل يسحبون
en: When carcans are about their necks and chains. They are dragged

source: في الحميم ثم في النار يسجرون
en: Through boiling waters; then they are thrust into the Fire.

source: ثم قيل لهم أين ما كنتم تشركون
en: Then it is said unto them: Where are (all) that ye used to make partners (in the Sovereignty)

source: من دون الله قالوا ضلوا عنا بل لم نكن ندعو من قبل شيئا كذلك يضل الله الكافرين
en: Beside Allah? They say: They have failed us; but we used not to pray to anything before. Thus doth Allah send astray the disbelievers (in His guidance).

source: ذلكم بما كنتم تفرحون في الأرض بغير الحق وبما كنتم تمرحون
en: (And it is said unto them): This is because ye exulted in the earth without right, and because ye were petulant.

source: ادخلوا أبواب جهنم خالدين فيها فبئس مثوى المتكبرين
en: Enter ye the gates of hell, to dwell therein. Evil is the habitation of the scornful.

source: فاصبر إن وعد الله حق فإما نرينك بعض الذي نعدهم أو نتوفينك فإلينا يرجعون
en: Then have patience (O Muhammad). Lo! the promise of Allah is true. And whether we let thee see a part of that which We promise them, or (whether) We cause thee to die, still unto Us they will be brought back.

source: ولقد أرسلنا رسلا من قبلك منهم من قصصنا عليك ومنهم من لم نقصص عليك وما كان لرسول أن يأتي بآية إلا بإذن الله فإذا جاء أمر الله قضي بالحق وخسر هنالك المبطلون
en: Verily We sent messengers before thee, among them those of whom We have told thee, and some of whom We have not told thee; and it was not given to any messenger that he should bring a portent save by Allah's leave, but when Allah's commandment cometh (the cause) is judged aright, and the followers of vanity will then be lost.

source: الله الذي جعل لكم الأنعام لتركبوا منها ومنها تأكلون
en: Allah it is Who hath appointed for you cattle, that ye may ride on some of them, and eat of some -

source: ولكم فيها منافع ولتبلغوا عليها حاجة في صدوركم وعليها وعلى الفلك تحملون
en: (Many) benefits ye have from them - and that ye may satisfy by their means a need that is in your breasts, and may be borne upon them as upon the ship.

source: ويريكم آياته فأي آيات الله تنكرون
en: And He showeth you His tokens. Which, then, of the tokens of Allah do ye deny?

source: أفلم يسيروا في الأرض فينظروا كيف كان عاقبة الذين من قبلهم كانوا أكثر منهم وأشد قوة وآثارا في الأرض فما أغنى عنهم ما كانوا يكسبون
en: Have they not travelled in the land to see the nature of the consequence for those before them? They were more numerous than these, and mightier in power and (in the) traces (which they left behind them) in the earth. But all that they used to earn availed them not.

source: فلما جاءتهم رسلهم بالبينات فرحوا بما عندهم من العلم وحاق بهم ما كانوا به يستهزئون
en: And when their messengers brought them clear proofs (of Allah's Sovereignty) they exulted in the knowledge they (themselves) possessed. And that which they were wont to mock befell them.

source: فلما رأوا بأسنا قالوا آمنا بالله وحده وكفرنا بما كنا به مشركين
en: Then, when they saw Our doom, they said: We believe in Allah only and reject (all) that we used to associate (with Him).

source: فلم يك ينفعهم إيمانهم لما رأوا بأسنا سنت الله التي قد خلت في عباده وخسر هنالك الكافرون
en: But their faith could not avail them when they saw Our doom. This is Allah's law which hath ever taken course for His bondmen. And then the disbelievers will be ruined.

source: تنزيل من الرحمن الرحيم
en: A revelation from the Beneficent, the Merciful,

source: كتاب فصلت آياته قرآنا عربيا لقوم يعلمون
en: A Scripture whereof the verses are expounded, a Lecture in Arabic for people who have knowledge,

source: بشيرا ونذيرا فأعرض أكثرهم فهم لا يسمعون
en: Good tidings and a warning. But most of them turn away so that they hear not.

source: وقالوا قلوبنا في أكنة مما تدعونا إليه وفي آذاننا وقر ومن بيننا وبينك حجاب فاعمل إننا عاملون
en: And they say: Our hearts are protected from that unto which thou (O Muhammad) callest us, and in our ears there is a deafness, and between us and thee there is a veil. Act, then. Lo! we also shall be acting.

source: قل إنما أنا بشر مثلكم يوحى إلي أنما إلهكم إله واحد فاستقيموا إليه واستغفروه وويل للمشركين
en: Say (unto them O Muhammad): I am only a mortal like you. It is inspired in me that your Allah is One Allah, therefor take the straight path unto Him and seek forgiveness of Him. And woe unto the idolaters,

source: الذين لا يؤتون الزكاة وهم بالآخرة هم كافرون
en: Who give not the poor-due, and who are disbelievers in the Hereafter.

source: إن الذين آمنوا وعملوا الصالحات لهم أجر غير ممنون
en: Lo! as for those who believe and do good works, for them is a reward enduring.

source: قل أئنكم لتكفرون بالذي خلق الأرض في يومين وتجعلون له أندادا ذلك رب العالمين
en: Say (O Muhammad, unto the idolaters): Disbelieve ye verily in Him Who created the earth in two Days, and ascribe ye unto Him rivals? He (and none else) is the Lord of the Worlds.

source: وجعل فيها رواسي من فوقها وبارك فيها وقدر فيها أقواتها في أربعة أيام سواء للسائلين
en: He placed therein firm hills rising above it, and blessed it and measured therein its sustenance in four Days, alike for (all) who ask;

source: ثم استوى إلى السماء وهي دخان فقال لها وللأرض ائتيا طوعا أو كرها قالتا أتينا طائعين
en: Then turned He to the heaven when it was smoke, and said unto it and unto the earth: Come both of you, willingly or loth. They said: We come, obedient.

source: فقضاهن سبع سماوات في يومين وأوحى في كل سماء أمرها وزينا السماء الدنيا بمصابيح وحفظا ذلك تقدير العزيز العليم
en: Then He ordained them seven heavens in two Days and inspired in each heaven its mandate; and We decked the nether heaven with lamps, and rendered it inviolable. That is the measuring of the Mighty, the Knower.

source: فإن أعرضوا فقل أنذرتكم صاعقة مثل صاعقة عاد وثمود
en: But if they turn away, then say: I warn you of a thunderbolt like the thunderbolt (which fell of old upon the tribes) of A'ad and Thamud;

source: إذ جاءتهم الرسل من بين أيديهم ومن خلفهم ألا تعبدوا إلا الله قالوا لو شاء ربنا لأنزل ملائكة فإنا بما أرسلتم به كافرون
en: When their messengers came unto them from before them and behind them, saying: Worship none but Allah! they said: If our Lord had willed, He surely would have sent down angels (unto us), so lo! we are disbelievers in that wherewith ye have been sent.

source: فأما عاد فاستكبروا في الأرض بغير الحق وقالوا من أشد منا قوة أولم يروا أن الله الذي خلقهم هو أشد منهم قوة وكانوا بآياتنا يجحدون
en: As for A'ad, they were arrogant in the land without right, and they said: Who is mightier than us in power? Could they not see that Allah Who created them, He was mightier than them in power? And they denied Our revelations.

source: فأرسلنا عليهم ريحا صرصرا في أيام نحسات لنذيقهم عذاب الخزي في الحياة الدنيا ولعذاب الآخرة أخزى وهم لا ينصرون
en: Therefor We let loose on them a raging wind in evil days, that We might make them taste the torment of disgrace in the life of the world. And verily the doom of the Hereafter will be more shameful, and they will not be helped.

source: وأما ثمود فهديناهم فاستحبوا العمى على الهدى فأخذتهم صاعقة العذاب الهون بما كانوا يكسبون
en: And as for Thamud, We gave them guidance, but they preferred blindness to the guidance, so the bolt of the doom of humiliation overtook them because of what they used to earn.

source: ونجينا الذين آمنوا وكانوا يتقون
en: And We delivered those who believed and used to keep their duty to Allah.

source: ويوم يحشر أعداء الله إلى النار فهم يوزعون
en: And (make mention of) the day when the enemies of Allah are gathered unto the Fire, they are driven on

source: حتى إذا ما جاءوها شهد عليهم سمعهم وأبصارهم وجلودهم بما كانوا يعملون
en: Till, when they reach it, their ears and their eyes and their skins testify against them as to what they used to do.

source: وقالوا لجلودهم لم شهدتم علينا قالوا أنطقنا الله الذي أنطق كل شيء وهو خلقكم أول مرة وإليه ترجعون
en: And they say unto their skins: Why testify ye against us? They say: Allah hath given us speech Who giveth speech to all things, and Who created you at the first, and unto Whom ye are returned.

source: وما كنتم تستترون أن يشهد عليكم سمعكم ولا أبصاركم ولا جلودكم ولكن ظننتم أن الله لا يعلم كثيرا مما تعملون
en: Ye did not hide yourselves lest your ears and your eyes and your skins should testify against you, but ye deemed that Allah knew not much of what ye did.

source: وذلكم ظنكم الذي ظننتم بربكم أرداكم فأصبحتم من الخاسرين
en: That, your thought which ye did think about your Lord, hath ruined you; and ye find yourselves (this day) among the lost.

source: فإن يصبروا فالنار مثوى لهم وإن يستعتبوا فما هم من المعتبين
en: And though they are resigned, yet the Fire is still their home; and if they ask for favour, yet they are not of those unto whom favour can be shown.

source: وقيضنا لهم قرناء فزينوا لهم ما بين أيديهم وما خلفهم وحق عليهم القول في أمم قد خلت من قبلهم من الجن والإنس إنهم كانوا خاسرين
en: And We assigned them comrades (in the world), who made their present and their past fairseeming unto them. And the Word concerning nations of the jinn and humankind who passed away before them hath effect for them. Lo! they were ever losers.

source: وقال الذين كفروا لا تسمعوا لهذا القرآن والغوا فيه لعلكم تغلبون
en: Those who disbelieve say: Heed not this Qur'an, and drown the hearing of it; haply ye may conquer.

source: فلنذيقن الذين كفروا عذابا شديدا ولنجزينهم أسوأ الذي كانوا يعملون
en: But verily We shall cause those who disbelieve to taste an awful doom, and verily We shall requite them the worst of what they used to do.

source: ذلك جزاء أعداء الله النار لهم فيها دار الخلد جزاء بما كانوا بآياتنا يجحدون
en: That is the reward of Allah's enemies: the Fire. Therein is their immortal home, payment forasmuch as they denied Our revelations.

source: وقال الذين كفروا ربنا أرنا اللذين أضلانا من الجن والإنس نجعلهما تحت أقدامنا ليكونا من الأسفلين
en: And those who disbelieve will say: Our Lord! Show us those who beguiled us of the jinn and humankind. We will place them underneath our feet that they may be among the nethermost.

source: إن الذين قالوا ربنا الله ثم استقاموا تتنزل عليهم الملائكة ألا تخافوا ولا تحزنوا وأبشروا بالجنة التي كنتم توعدون
en: Lo! those who say: Our Lord is Allah, and afterward are upright, the angels descend upon them, saying: Fear not nor grieve, but hear good tidings of the paradise which ye are promised.

source: نحن أولياؤكم في الحياة الدنيا وفي الآخرة ولكم فيها ما تشتهي أنفسكم ولكم فيها ما تدعون
en: We are your protecting friends in the life of the world and in the Hereafter. There ye will have (all) that your souls desire, and there ye will have (all) for which ye pray.

source: نزلا من غفور رحيم
en: A gift of welcome from One Forgiving, Merciful.

source: ومن أحسن قولا ممن دعا إلى الله وعمل صالحا وقال إنني من المسلمين
en: And who is better in speech than him who prayeth unto his Lord and doeth right, and saith: Lo! I am of those who are muslims (surrender unto Him).

source: ولا تستوي الحسنة ولا السيئة ادفع بالتي هي أحسن فإذا الذي بينك وبينه عداوة كأنه ولي حميم
en: The good deed and the evil deed are not alike. Repel the evil deed with one which is better, then lo! he, between whom and thee there was enmity (will become) as though he was a bosom friend.

source: وما يلقاها إلا الذين صبروا وما يلقاها إلا ذو حظ عظيم
en: But none is granted it save those who are steadfast, and none is granted it save the owner of great happiness.

source: وإما ينزغنك من الشيطان نزغ فاستعذ بالله إنه هو السميع العليم
en: And if a whisper from the devil reach thee (O Muhammad) then seek refuge in Allah. Lo! He is the Hearer, the Knower.

source: ومن آياته الليل والنهار والشمس والقمر لا تسجدوا للشمس ولا للقمر واسجدوا لله الذي خلقهن إن كنتم إياه تعبدون
en: And of His portents are the night and the day and the sun and the moon. Do not prostrate to the sun or the moon; but prostrate to Allah Who created them, if it is in truth Him Whom ye worship.

source: فإن استكبروا فالذين عند ربك يسبحون له بالليل والنهار وهم لا يسأمون
en: But if they are too proud - still those who are with thy Lord glorify Him night and day, and tire not.

source: ومن آياته أنك ترى الأرض خاشعة فإذا أنزلنا عليها الماء اهتزت وربت إن الذي أحياها لمحيي الموتى إنه على كل شيء قدير
en: And of His portents (is this): that thou seest the earth lowly, but when We send down water thereon it thrilleth and groweth. Lo! He Who quickeneth it is verily the Quickener of the Dead. Lo! He is Able to do all things.

source: إن الذين يلحدون في آياتنا لا يخفون علينا أفمن يلقى في النار خير أم من يأتي آمنا يوم القيامة اعملوا ما شئتم إنه بما تعملون بصير
en: Lo! those who distort Our revelations are not hid from Us. Is he who is hurled into the Fire better, or he who cometh secure on the Day of Resurrection? Do what ye will. Lo! He is Seer of what ye do.

source: إن الذين كفروا بالذكر لما جاءهم وإنه لكتاب عزيز
en: Lo! those who disbelieve in the Reminder when it cometh unto them (are guilty), for lo! it is an unassailable Scripture.

source: لا يأتيه الباطل من بين يديه ولا من خلفه تنزيل من حكيم حميد
en: Falsehood cannot come at it from before it or from behind it. (It is) a revelation from the Wise, the Owner of Praise.

source: ما يقال لك إلا ما قد قيل للرسل من قبلك إن ربك لذو مغفرة وذو عقاب أليم
en: Naught is said unto thee (Muhammad) save what was said unto the messengers before thee. Lo! thy Lord is owner of forgiveness, and owner (also) of dire punishment.

source: ولو جعلناه قرآنا أعجميا لقالوا لولا فصلت آياته أأعجمي وعربي قل هو للذين آمنوا هدى وشفاء والذين لا يؤمنون في آذانهم وقر وهو عليهم عمى أولئك ينادون من مكان بعيد
en: And if We had appointed it a Lecture in a foreign tongue they would assuredly have said: If only its verses were expounded (so that we might understand)? What! A foreign tongue and an Arab? - Say unto them (O Muhammad): For those who believe it is a guidance and a healing; and as for those who disbelieve, there is a deafness in their ears, and it is blindness for them. Such are called to from afar.

source: من عمل صالحا فلنفسه ومن أساء فعليها وما ربك بظلام للعبيد
en: Whoso doeth right it is for his soul, and whoso doeth wrong it is against it. And thy Lord is not at all a tyrant to His slaves.

source: إليه يرد علم الساعة وما تخرج من ثمرات من أكمامها وما تحمل من أنثى ولا تضع إلا بعلمه ويوم يناديهم أين شركائي قالوا آذناك ما منا من شهيد
en: Unto Him is referred (all) knowledge of the Hour. And no fruits burst forth from their sheaths, and no female carrieth or bringeth forth but with His knowledge. And on the day when He calleth unto them: Where are now My partners? they will say: We confess unto Thee, not one of us is a witness (for them).

source: وضل عنهم ما كانوا يدعون من قبل وظنوا ما لهم من محيص
en: And those to whom they used to cry of old have failed them, and they perceive they have no place of refuge.

source: لا يسأم الإنسان من دعاء الخير وإن مسه الشر فيئوس قنوط
en: Man tireth not of praying for good, and if ill toucheth him, then he is disheartened, desperate.

source: ولئن أذقناه رحمة منا من بعد ضراء مسته ليقولن هذا لي وما أظن الساعة قائمة ولئن رجعت إلى ربي إن لي عنده للحسنى فلننبئن الذين كفروا بما عملوا ولنذيقنهم من عذاب غليظ
en: And verily, if We cause him to taste mercy after some hurt that hath touched him, he will say: This is my own; and I deem not that the Hour will ever rise, and if I am brought back to my Lord, I surely shall be better off with Him - But We verily shall tell those who disbelieve (all) that they did, and We verily shall make them taste hard punishment.

source: وإذا أنعمنا على الإنسان أعرض ونأى بجانبه وإذا مسه الشر فذو دعاء عريض
en: When We show favour unto man, he withdraweth and turneth aside, but when ill toucheth him then he aboundeth in prayer.

source: قل أرأيتم إن كان من عند الله ثم كفرتم به من أضل ممن هو في شقاق بعيد
en: Bethink you: If it is from Allah and ye reject it - Who is further astray than one who is at open feud (with Allah)?

source: سنريهم آياتنا في الآفاق وفي أنفسهم حتى يتبين لهم أنه الحق أولم يكف بربك أنه على كل شيء شهيد
en: We shall show them Our portents on the horizons and within themselves until it will be manifest unto them that it is the Truth. Doth not thy Lord suffice, since He is Witness over all things?

source: ألا إنهم في مرية من لقاء ربهم ألا إنه بكل شيء محيط
en: How! Are they still in doubt about the meeting with their Lord? Lo! Is not He surrounding all things?

source: عسق
en: A'in. Sin. Qaf.

source: كذلك يوحي إليك وإلى الذين من قبلك الله العزيز الحكيم
en: Thus Allah the Mighty, the Knower inspireth thee (Muhammad) as (He inspired) those before thee.

source: له ما في السماوات وما في الأرض وهو العلي العظيم
en: Unto Him belongeth all that is in the heavens and all that is in the earth, and He is the Sublime, the Tremendous.

source: تكاد السماوات يتفطرن من فوقهن والملائكة يسبحون بحمد ربهم ويستغفرون لمن في الأرض ألا إن الله هو الغفور الرحيم
en: Almost might the heavens above be rent asunder while the angels hymn the praise of their Lord and ask forgiveness for those on the earth. Lo! Allah, He is the Forgiver, the Merciful.

source: والذين اتخذوا من دونه أولياء الله حفيظ عليهم وما أنت عليهم بوكيل
en: And as for those who choose protecting friends beside Him, Allah is Warden over them, and thou art in no wise a guardian over them.

source: وكذلك أوحينا إليك قرآنا عربيا لتنذر أم القرى ومن حولها وتنذر يوم الجمع لا ريب فيه فريق في الجنة وفريق في السعير
en: And thus We have inspired in thee a Lecture in Arabic, that thou mayst warn the mother-town and those around it, and mayst warn of a day of assembling whereof there is no doubt. A host will be in the Garden, and a host of them in the Flame.

source: ولو شاء الله لجعلهم أمة واحدة ولكن يدخل من يشاء في رحمته والظالمون ما لهم من ولي ولا نصير
en: Had Allah willed, He could have made them one community, but Allah bringeth whom He will into His mercy. And the wrong-doers have no friend nor helper.

source: أم اتخذوا من دونه أولياء فالله هو الولي وهو يحيي الموتى وهو على كل شيء قدير
en: Or have they chosen protecting friends besides Him? But Allah, He (alone) is the Protecting Friend. He quickeneth the dead, and He is Able to do all things.

source: وما اختلفتم فيه من شيء فحكمه إلى الله ذلكم الله ربي عليه توكلت وإليه أنيب
en: And in whatsoever ye differ, the verdict therein belongeth to Allah. Such is my Lord, in Whom I put my trust, and unto Whom I turn.

source: فاطر السماوات والأرض جعل لكم من أنفسكم أزواجا ومن الأنعام أزواجا يذرؤكم فيه ليس كمثله شيء وهو السميع البصير
en: The Creator of the heavens and the earth. He hath made for you pairs of yourselves, and of the cattle also pairs, whereby He multiplieth you. Naught is as His likeness; and He is the Hearer, the Seer.

source: له مقاليد السماوات والأرض يبسط الرزق لمن يشاء ويقدر إنه بكل شيء عليم
en: His are the keys of the heavens and the earth. He enlargeth providence for whom He will and straiteneth (it for whom He will). Lo! He is Knower of all things.

source: شرع لكم من الدين ما وصى به نوحا والذي أوحينا إليك وما وصينا به إبراهيم وموسى وعيسى أن أقيموا الدين ولا تتفرقوا فيه كبر على المشركين ما تدعوهم إليه الله يجتبي إليه من يشاء ويهدي إليه من ينيب
en: He hath ordained for you that religion which He commended unto Noah, and that which We inspire in thee (Muhammad), and that which We commended unto Abraham and Moses and Jesus, saying: Establish the religion, and be not divided therein. Dreadful for the idolaters is that unto which thou callest them. Allah chooseth for Himself whom He will, and guideth unto Himself him who turneth (toward Him).

source: وما تفرقوا إلا من بعد ما جاءهم العلم بغيا بينهم ولولا كلمة سبقت من ربك إلى أجل مسمى لقضي بينهم وإن الذين أورثوا الكتاب من بعدهم لفي شك منه مريب
en: And they were not divided until after the knowledge came unto them, through rivalry among themselves; and had it not been for a Word that had already gone forth from thy Lord for an appointed term, it surely had been judged between them. And those who were made to inherit the Scripture after them are verily in hopeless doubt concerning it.

source: فلذلك فادع واستقم كما أمرت ولا تتبع أهواءهم وقل آمنت بما أنزل الله من كتاب وأمرت لأعدل بينكم الله ربنا وربكم لنا أعمالنا ولكم أعمالكم لا حجة بيننا وبينكم الله يجمع بيننا وإليه المصير
en: Unto this, then, summon (O Muhammad). And be thou upright as thou art commanded, and follow not their lusts, but say: I believe in whatever scripture Allah hath sent down, and I am commanded to be just among you. Allah is our Lord and your Lord. Unto us our works and unto you your works; no argument between us and you. Allah will bring us together, and unto Him is the journeying.

source: والذين يحاجون في الله من بعد ما استجيب له حجتهم داحضة عند ربهم وعليهم غضب ولهم عذاب شديد
en: And those who argue concerning Allah after He hath been acknowledged, their argument hath no weight with their Lord, and wrath is upon them and theirs will be an awful doom.

source: الله الذي أنزل الكتاب بالحق والميزان وما يدريك لعل الساعة قريب
en: Allah it is Who hath revealed the Scripture with truth, and the Balance. How canst thou know? It may be that the Hour is nigh.

source: يستعجل بها الذين لا يؤمنون بها والذين آمنوا مشفقون منها ويعلمون أنها الحق ألا إن الذين يمارون في الساعة لفي ضلال بعيد
en: Those who believe not therein seek to hasten it, while those who believe are fearful of it and know that it is the Truth. Are not they who dispute, in doubt concerning the Hour, far astray?

source: الله لطيف بعباده يرزق من يشاء وهو القوي العزيز
en: Allah is gracious unto His slaves. He provideth for whom He will. And He is the Strong, the Mighty.

source: من كان يريد حرث الآخرة نزد له في حرثه ومن كان يريد حرث الدنيا نؤته منها وما له في الآخرة من نصيب
en: Whoso desireth the harvest of the Hereafter, We give him increase in its harvest. And whoso desireth the harvest of the world, We give him thereof, and he hath no portion in the Hereafter.

source: أم لهم شركاء شرعوا لهم من الدين ما لم يأذن به الله ولولا كلمة الفصل لقضي بينهم وإن الظالمين لهم عذاب أليم
en: Or have they partners (of Allah) who have made lawful for them in religion that which Allah allowed not? And but for a decisive word (gone forth already), it would have been judged between them. Lo! for wrong-doers is a painful doom.

source: ترى الظالمين مشفقين مما كسبوا وهو واقع بهم والذين آمنوا وعملوا الصالحات في روضات الجنات لهم ما يشاءون عند ربهم ذلك هو الفضل الكبير
en: Thou seest the wrong-doers fearful of that which they have earned, and it will surely befall them, while those who believe and do good works (will be) in flowering meadows of the Gardens, having what they wish from their Lord. This is the great preferment.

source: ذلك الذي يبشر الله عباده الذين آمنوا وعملوا الصالحات قل لا أسألكم عليه أجرا إلا المودة في القربى ومن يقترف حسنة نزد له فيها حسنا إن الله غفور شكور
en: This it is which Allah announceth unto His bondmen who believe and do good works. Say (O Muhammad, unto mankind): I ask of you no fee therefor, save lovingkindness among kinsfolk. And whoso scoreth a good deed We add unto its good for him. Lo! Allah is Forgiving, Responsive.

source: أم يقولون افترى على الله كذبا فإن يشإ الله يختم على قلبك ويمح الله الباطل ويحق الحق بكلماته إنه عليم بذات الصدور
en: Or say they: He hath invented a lie concerning Allah? If Allah willed, He could have sealed thy heart (against them). And Allah will wipe out the lie and will vindicate the truth by His words. Lo! He is Aware of what is hidden in the breasts (of men).

source: وهو الذي يقبل التوبة عن عباده ويعفو عن السيئات ويعلم ما تفعلون
en: And He it is Who accepteth repentance from His bondmen, and pardoneth the evil deeds, and knoweth what ye do,
